# X Field

---
C#Visual BasicVisual C++
Revit 2024 API
---
CloudPoint..::..X Field
CloudPoint Structure See Also
---
The X coordinate
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public float X
```

Visual Basic
---
```text
Public X As Single
```

Visual C++
---
```text
public:
float X
```

# See Also
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace